import { Button, Stack, Typography, Box } from '@mui/material';
import { Link } from 'react-router-dom';

export const FAQparents= () => {
  return (
    <div>
    <Box
      sx={{
        padding: '30px',
        backgroundColor: 'background.paper',
        border: '1px solid grey',
        borderRadius: '8px',
        boxShadow: 3,
        marginLeft: '40px',
        marginRight: '40px',
      }}
    >
        <Typography variant='h4'>
            Συχνές Ερωτήσεις από γονείς/κηδεμόνες
        </Typography>
        <Typography variant='h5'>
            1. Ποια η διαδικασία που πρέπει να ακολουθηθεί για την εύρεση νταντάς; 
        </Typography>
        <Typography variant='h6' color='text.secondary'>
            Οι γονείς μπορούν να αναρτήσουν αγγελίες και να χρησιμοποιήσουν τα φίλτρα αναζήτησης για να βρουν νταντάδες που πληρούν τα κριτήριά τους. Αφού βρουν υποψήφιους επαγγελματίες, μπορούν να κλείσουν ραντεβού γνωριμίας και να αποστείλουν αιτήματα συνεργασίας.
        </Typography>
        <Typography variant='h5'>
            2. Ποια κριτήρια πρέπει να ικανοποιούνται για την πρόσληψη επαγγελματία/νταντας;
        </Typography>
        <Typography variant='h6' color='text.secondary'>
            Δικαίωμα συμμετοχής έχουν: α) μητέρες και πατέρες φυσικές, θετές ή ανάδοχες, με βρέφος ή νήπιο με οποιαδήποτε μορφή απασχόλησης (και ταμείο ανεργείας). Το ετήσιο ατομικό εισόδημά σας να μην υπερβαίνει το ποσό των 24.000 €. β. Να είστε εργαζόμενη/ος ή άνεργη εγγεγραμμένη στα μητρώα της ΔΥΠΑ (Προσοχή! η ανεργία αφορά μόνο στη μητέρα που υποβάλλει αίτηση).
        </Typography>
        <Typography variant='h5'>
            3. Πώς και πότε πραγματοποιείται η πληρωμή του επαγγελματία;
        </Typography>
        <Typography variant='h6' color='text.secondary'>
            Η πληρωμή γίνεται μέσω του συστήματος της πλατφόρμας, συνήθως με τη χρήση ψηφιακού voucher που δημιουργείται αυτόματα κάθε μήνα, αφού πιστοποιηθεί η ολοκλήρωση της εργασίας.
        </Typography>
        <Typography variant='h5'>
            4. Τι ισχύει για την αξιολόγηση και την κριτική του επαγγελματία μετά τη λήξη της συνεργασίας;
        </Typography>
        <Typography variant='h6' color='text.secondary'>
            Μετά τη λήξη της συνεργασίας, οι γονείς έχουν τη δυνατότητα να υποβάλουν αξιολόγηση και σχόλια που θα είναι ορατά στο προφίλ του επαγγελματία, βοηθώντας άλλους χρήστες να ενημερωθούν για την ποιότητα της δουλειάς του.
        </Typography>
    </Box>
    </div>
  );
}